<a href="https://colab.research.google.com/github/clearlyCoding/PySpark--Titanic-Dataset/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
!tar xf spark-3.1.1-bin-hadoop3.2.tgz
!pip install -q findspark

In [2]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"

In [3]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
spark.conf.set("spark.sql.repl.eagerEval.enabled", True) # Property used to format output tables better
spark

In [5]:
#load csv
ttnc_df = spark.read.csv("train.csv", header = True, inferSchema=True)
ttnc_df

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [7]:
ttnc_df.select('Survived', 'Fare')

+--------+--------+
|Survived|    Fare|
+--------+--------+
|       1| 71.2833|
|       1|   7.925|
|       1|    53.1|
|       1| 11.1333|
|       1| 30.0708|
|       1|    16.7|
|       1|   26.55|
|       1|    16.0|
|       1|    13.0|
|       1|   7.225|
|       1|    13.0|
|       1|  8.0292|
|       1|    35.5|
|       1| 31.3875|
|       1|  7.8792|
|       1|146.5208|
|       1|    7.75|
|       1|  7.2292|
|       1| 11.2417|
|       1| 41.5792|
+--------+--------+
only showing top 20 rows

In [9]:
ttnc_df.select('Survived', 'Fare').where(ttnc_df.Survived == 1)

+--------+--------+
|Survived|    Fare|
+--------+--------+
|       1| 71.2833|
|       1|   7.925|
|       1|    53.1|
|       1| 11.1333|
|       1| 30.0708|
|       1|    16.7|
|       1|   26.55|
|       1|    16.0|
|       1|    13.0|
|       1|   7.225|
|       1|    13.0|
|       1|  8.0292|
|       1|    35.5|
|       1| 31.3875|
|       1|  7.8792|
|       1|146.5208|
|       1|    7.75|
|       1|  7.2292|
|       1| 11.2417|
|       1| 41.5792|
+--------+--------+
only showing top 20 rows

In [15]:
ttnc_df.groupBy('Survived').agg({'Fare':'avg'})

+--------+------------------+
|Survived|         avg(Fare)|
+--------+------------------+
|       1| 48.39540760233917|
|       0|22.117886885245877|
+--------+------------------+

In [17]:
ttnc_df.where(ttnc_df.Sex == 'male').groupBy('Survived').agg({'Fare':'avg'})

+--------+------------------+
|Survived|         avg(Fare)|
+--------+------------------+
|       1| 40.82148440366974|
|       0|21.960992948717944|
+--------+------------------+

In [19]:
ttnc_df.groupBy('Sex','Survived').agg({'Fare':'avg'})

+------+--------+------------------+
|   Sex|Survived|         avg(Fare)|
+------+--------+------------------+
|  male|       0|21.960992948717944|
|female|       1| 51.93857339055791|
|female|       0| 23.02438518518519|
|  male|       1| 40.82148440366974|
+------+--------+------------------+

In [ ]:
from pyspark.sql.types import IntegerType, StringType
import math

def create_cat(y):
  if y == "Age":
    pass
  else:
    print(y)
    x = int(y)
    if x<=10:
      ret= "Child"
    if x>10 and x<20:
      ret = "Teenager"
    if x>20 and x<60:
      ret = "Adult"
    if x>=60:
      ret = "Elderly" 
    
    return ret

create_cat_udf = udf(create_cat, StringType())
ttnc_df.select(create_cat_udf('Age'))

In [24]:
ttnc_df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)